experiments/data/stats/ycsb_d_run4.out
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -load -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadd -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 12938
[OVERALL], Throughput(ops/sec), 77291.6988715412
[TOTAL_GCS_G1_Young_Generation], Count, 8
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 37
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.2859792858247024
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 8
[TOTAL_GC_TIME], Time(ms), 37
[TOTAL_GC_TIME_%], Time(%), 0.2859792858247024
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 2380800.0
[CLEANUP], MinLatency(us), 2379776
[CLEANUP], MaxLatency(us), 2381823
[CLEANUP], 50thPercentileLatency(us), 2381823
[CLEANUP], 95thPercentileLatency(us), 2381823
[CLEANUP], 99thPercentileLatency(us), 2381823
[INSERT], Operations, 1000000
[INSERT], AverageLatency(us), 9.264582
[INSERT], MinLatency(us), 5
[INSERT], MaxLatency(us), 24751
[INSERT], 50thPercentileLatency(us), 9
[INSERT], 95thPercentileLatency(us), 14
[INSERT], 99thPercentileLatency(us), 21
[INSERT], Return=OK, 1000000
/usr/bin/java  -classpath /home/cc/YCSB/conf:/home/cc/YCSB/core/target/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/core/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/core/target/dependency/bsh-2.0b4.jar:/home/cc/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/core/target/dependency/jcommander-1.12.jar:/home/cc/YCSB/core/target/dependency/junit-3.8.1.jar:/home/cc/YCSB/core/target/dependency/snakeyaml-1.6.jar:/home/cc/YCSB/core/target/dependency/testng-6.1.1.jar:/home/cc/YCSB/rocksdb/target/rocksdb-binding-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/HdrHistogram-2.1.12.jar:/home/cc/YCSB/rocksdb/target/dependency/core-0.18.0-SNAPSHOT.jar:/home/cc/YCSB/rocksdb/target/dependency/hamcrest-core-1.3.jar:/home/cc/YCSB/rocksdb/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-core-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/cc/YCSB/rocksdb/target/dependency/jcip-annotations-1.0.jar:/home/cc/YCSB/rocksdb/target/dependency/junit-4.12.jar:/home/cc/YCSB/rocksdb/target/dependency/rocksdbjni-6.2.2.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-api-1.7.25.jar:/home/cc/YCSB/rocksdb/target/dependency/slf4j-simple-1.7.25.jar site.ycsb.Client -t -db site.ycsb.db.rocksdb.RocksDBClient -P /home/cc/ycsb_workloads/1x/workloadd -p rocksdb.dir=/tmp/ycsb-rocksdb-data
[OVERALL], RunTime(ms), 11927
[OVERALL], Throughput(ops/sec), 83843.38056510438
[TOTAL_GCS_G1_Young_Generation], Count, 5
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 24
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.20122411335625054
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 5
[TOTAL_GC_TIME], Time(ms), 24
[TOTAL_GC_TIME_%], Time(%), 0.20122411335625054
[READ], Operations, 950235
[READ], AverageLatency(us), 7.990302398880277
[READ], MinLatency(us), 1
[READ], MaxLatency(us), 11895
[READ], 50thPercentileLatency(us), 3
[READ], 95thPercentileLatency(us), 36
[READ], 99thPercentileLatency(us), 60
[READ], Return=OK, 950235
[CLEANUP], Operations, 1
[CLEANUP], AverageLatency(us), 12228.0
[CLEANUP], MinLatency(us), 12224
[CLEANUP], MaxLatency(us), 12231
[CLEANUP], 50thPercentileLatency(us), 12231
[CLEANUP], 95thPercentileLatency(us), 12231
[CLEANUP], 99thPercentileLatency(us), 12231
[INSERT], Operations, 49765
[INSERT], AverageLatency(us), 11.705495830402894
[INSERT], MinLatency(us), 6
[INSERT], MaxLatency(us), 632
[INSERT], 50thPercentileLatency(us), 11
[INSERT], 95thPercentileLatency(us), 18
[INSERT], 99thPercentileLatency(us), 26
[INSERT], Return=OK, 49765